daanish-arya/ECE3091/Final Code.cydsn/Generated_Source/PSoC5/Echo.h
/*******************************************************************************
* File Name: Echo.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_Echo_H) /* CY_STATUS_REG_Echo_H */
#define CY_STATUS_REG_Echo_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} Echo_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 Echo_Read(void) ;
void Echo_InterruptEnable(void) ;
void Echo_InterruptDisable(void) ;
void Echo_WriteMask(uint8 mask) ;
uint8 Echo_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define Echo_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define Echo_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define Echo_Status             (* (reg8 *) Echo_sts_sts_reg__STATUS_REG )
#define Echo_Status_PTR         (  (reg8 *) Echo_sts_sts_reg__STATUS_REG )
#define Echo_Status_Mask        (* (reg8 *) Echo_sts_sts_reg__MASK_REG )
#define Echo_Status_Aux_Ctrl    (* (reg8 *) Echo_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_Echo_H */


/* [] END OF FILE */
